package org.example.homeworks.homework2;

public class Easy {
    public static void main(String[] args) {
        System.out.println("------------- Задача 1 -------------");
        multiplyTable();
        System.out.println("------------------------------------");
        System.out.println("\n------------- Задача 2 -------------");
        sumNumbers();
        System.out.println("------------------------------------");
        System.out.println("\n------------- Задача 3 -------------");

        System.out.println("------------------------------------");


    }

    public static void multiplyTable() {
        //todo: вывести на экран таблицу умножения
    }

    public static void sumNumbers() {
        //todo: реализовать суммирование от 1 до number(включительно) нужно использовать сканнер
    }

    public static void subsequence() {
        //todo: реализация последовательности
    }
}

/*
задача 1: (цикл for)
вывести на экран таблицу умножения в виде:
1 * 1 = 1
1 * 2 = 2
. . . . .
9 * 8 = 72
9 * 9 = 81
-----------------------------------------------------
задача 2: (цикл for)
Напишите программу, где пользователь вводит любое целое положительное число.
А программа суммирует все числа от 1 до введенного пользователем числа.

Например:

если пользователь введет число 3.
Программа должна посчитать сумму чисел от 1 до 3, то есть 1+2+3 и выдать ответ 6.

если пользователь введет число 5.
Программа должна посчитать сумму чисел от 1 до 5, то есть 1+2+3+4+5 и выдать ответ 15.
------------------------------------------------------

задача 3: (цикл while)
Необходимо, чтоб программа выводила на экран вот такую последовательность:

1 2 4 8 16 32 64 128 256 512
---------------------------------------------------------
 */
