package org.example.homeworks.homework3;

public class Easy {
    public static void main(String[] args) {
        System.out.println("--------------- task 1 ----------------");
        int max = maxInArray();
        System.out.println(max);
        System.out.println("---------------------------------------");
        System.out.println("--------------- task 2 ----------------");
        int avg = avg();
        System.out.println(avg);
        System.out.println("---------------------------------------");
        System.out.println("--------------- task 3 ----------------");
        int countWords = countWords();
        System.out.println(countWords);
        System.out.println("---------------------------------------");

    }

    public static int maxInArray() {
        return 1;
    }

    public static int avg() {
        return 1;
    }

    public static int countWords() {
        return 1;
    }
}

/*
1.
Найти максимальный элемент в массиве из сгенерированных чисел

Создайте массив из 12 случайных целых чисел из отрезка [-15;15].
Определите какой элемент является в этом массиве максимальным и сообщите индекс его последнего вхождения в массив.

2.
Среднее арифметическое элементов массива

    2.1. Создайте 2 массива из 5 случайных целых чисел из отрезка [0;5] каждый

    2.2. Выведите массивы на экран в двух отдельных строках

    2.3. Посчитайте среднее арифметическое элементов каждого массива и сообщите,
    для какого из массивов это значение оказалось больше (либо сообщите, что их средние арифметические равны)

3.
Определить количество слов в веденной строке.

 */
